Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
import pandas as pd
data = [4,8,15,16,23,42]
ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
data1 = [10,20,30,40,50,60,70,80,90,100]
ser1 = pd.Series(data1)
ser1

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
data2 = {'Name' : ['Alice','Bob','Claire'],
         'Age' : [25,30,27],
         'Gender' : ['Female','Male','Female']
}

In [15]:
df = pd.DataFrame(data2)

In [16]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is the data structure of pandas library which contains the data in tabular format.It is in two dimensional format
Series is the data structure in the pandas which contain the data in the form of list.It is in single dimensional format

In [20]:
#pandas series
ser = pd.Series([100,200,300,400,500])
ser

0    100
1    200
2    300
3    400
4    500
dtype: int64

In [21]:
#pandas dataframe
df = pd.DataFrame([100,200,300,400,500])
df

     0
0  100
1  200
2  300
3  400
4  500

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

.read_csv(),.head(),.tail(),.dtype,.columns etc are some common functions used in Pandas DataFrame
We can use these functions when we want datatype of data in present file,when we want to know the no of columns and no of rows of our DataFrame

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame and Panel

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [42]:
Name = pd.Series(['Peter','Bob'])
Subject = pd.Series(['Physics','Chemistry'])
Marks = pd.Series([90,70])

In [43]:
data = {"Name":Name,'Subject':Subject,'Marks':Marks}

In [44]:
df1 = pd.DataFrame(data)

In [45]:
df1

    Name    Subject  Marks
0  Peter    Physics     90
1    Bob  Chemistry     70